# Análise de Dados com pandas 
O pandas (planilha em python) é uma biblioteca de análise de dados python. Os superpoderes importantes dela é a vetorização(permite escrever o código conciso e baseaddo em array) e o alinhamentos de dados (garante que não haja incompatibilidade de dados ao trabalhar com vários conjuntos de dados).

- Análise de Dados (seja para DataScience, seja para trabalhar de forma integrada com arquivos em Excel e Banco de Dados)
- Melhor biblioteca/módulo para trabalhar com quantidades enormes de informações
- Uma mistura de listas e dicionários de forma muito eficiente

Obs.1: É necessário importar a sua biblioteca inicialmente ao código(desde que esteja instalado essa biblioteca **pip install pandas**).
Obs.2: O **as** atribuir ao módulo da biblioteca **pandas** um apelido curto **pd**
- import pandas as pd 
O dataframe é umas principais estruturas de dados do pandas. ELe é um objeto no pandas que essencialmente é uma tabela. Ele compom-se
- índice (corresponde as linhas) -> funcionam como listas
- colunas -> funcionam como "chaves de dicionario"
- dados (o que esta contido dentro de cada coluna/linha)
        dataframe = pd.read_excel("arquivo_com_extensao.xlsx")

* Uma maneira de criar um datafraem é fornecer os dados como uma lista aninhada, juntamente com valores para **columns** e **index**
data = [["Mark", 55, "Italy", 4.5, "Europe"],
        ["John", 33, "USA", 6.7, "America"],
        ["Tim", 41, "USA", 3.9, "America"],
        ["Jenny", 12, "Germany", 9.0, "Europe"]]
df = pd.DataFrame(data=data,
                  columns=["name", "age", "country",
                           "score", "continent"],
                  index=[1001, 1000, 1002, 1003])
df
* Temos um dataframe:

vendas_df['coluna_x'] -> uma lista com os valores da coluna_x (em formato dataframe, é um dataframe com 1 coluna só)<br>
vendas_df[0] -> NÃO FUNCIONA ASSIM PARA DATAFRAMES<br>
vendas_df[:3] -> pega até a linha de índice 3 do dataframe<br>
vendas_df[['coluna_x', 'coluna_y', 'coluna_z']] -> cria um novo dataframe com as colunas coluna_x, coluna_y e coluna_z<br>
vendas_df['coluna_x'][0] -> pega o itemd a 1ª linha da coluna coluna_x<br>

1. Obtem informações básicas: números de pontos de dados e os tipos de dados de cada coluna
- df.info()
Obs.: Se for dados da coluna somente: df.dtypes

2. Criar um indice: Um indice permitirar que o pandas procure mais rapidamente e ele é essencial para combinar dois DataFrames
- df.index
var_criada_dataframe.index #Chama os index (equivale as linhas)<br>
    
    Obs.1: Se quiser pode dar nome ao indice -> df.index.name = "nome_indice"<br>
        var_criada_dataframe.index.name = "User ID" #Dar um nome ao indice<br>

    Obs.2: Para transforma um indice em uma coluna comum -> df.reset_index()<br>
        var_criada_dataframe.reset_index() #Transforma o indice em coluna<br>

    Obs.3: Para definir um novo indice -> df.reset_index().set_index("nome_novo_indice")
        var_criada_dataframe.reset_index().set_index("name") #Transforma o "nome" da coluna em indice<br>

    Obs.4: Recebe de volta uma copia do DF com aquele metodo aplicado, deixando o DF original intocado<br>
        var_criada_dataframe = var_criada_dataframe.reset_index()<br>

    Obs.5: Altera o indice<br>
        var_criada_dataframe.reindex([999, 1000, 1001, 1004]) #Alterar um indice<br>

    Obs.6: Classifica um indice<br>
        var_criada_dataframe.sort_index() #Classificar um indice<br>

    Obs.7: Classificar as linhas por uma ou mais coluna<br>
        var_criada_dataframe.sort_values(["continent", "age"])<br>

3. Criar colunas:
- df.columns


* Tirar as colunas inúteis ou pegar apenas as colunas que quisermos
- .drop([coluna1, coluna2, coluna3]) -> retira as colunas: coluna1, coluna2, coluna3
* Juntar os dataframes para ter 1 único dataframe com tudo
- novo_dataframe = dataframe1.merge(dataframe2, on='coluna')
Obs: O merge precisa das colunas com o mesmo nome para funcionar. Se não tiver, você precisa alterar o nome da coluna com o .rename<br>
dataframe.rename({'coluna1': 'novo_coluna_1'})



## Métodos para analisar nossas tabelas (dataframes)

Usar os plot de gráfico padrões do pandas, mas no projeto de DataScience veremos outras mais bonitas e também muito práticas.

OBS: O pandas usa o matplotlib (que vimos na seção de "módulos e bibliotecas") para plotar gráficos.<br>
Se quiser personalizar mais do que o padrão do pandas, importe o matplotlib e use os métodos do matplotlib

- Usaremos o método .value_counts() para contar quantas vezes cada valor do Dataframe aparece
- Usaremos o método .plot() para exibir um gráfico
- Usaremos o .groupby para agrupar o nosso dataframe, de acordo com o que queremos (somando as quantidades de vendas, por exemplo)
- Agora precisamos pegar o maior valor. Temos 2 formas:
    1. Ordenar o dataframe em ordem decrescente de Quantidade Vendida
        - Método .sort_values
    2. Pegar o Maior valor diretamente
        - Métodos .max() e .idxmax()
        1. min() e max()
        2. idxmin() e idxmax()

In [18]:
import pandas as pd 
#informar o local do arquivo dentro do chamado
#variavel_dataframe = pd.read_excel(r'C:\Users\E1180062\Downloads\Python para Excel-Estudos\Relatório Geral das Amostras.xlsx') 
#imprimir a tabela
#print(variavel_dataframe)
#às vezes precisaremos mudar o encoding. Possiveis valores para testar:
#encoding='latin1', encoding='ISO-8859-1', encoding='utf-8' ou então encoding='cp1252'

#criação de dataframe
criacao_dataframe = [["Mark", 55, "Italy", 4.5, "Europe"],
                    ["John", 33, "USA", 6.7, "America"],
                    ["Tim", 41, "USA", 3.9, "America"],
                    ["Jenny", 12, "Germany", 9.0, "Europe"]]
var_criada_dataframe = pd.DataFrame(data=criacao_dataframe,
                                    columns=["name", "age", "country",
                                                "score", "continent"],
                                    index=[1001, 1000, 1002, 1003])
print(var_criada_dataframe)

       name  age  country  score continent
1001   Mark   55    Italy    4.5    Europe
1000   John   33      USA    6.7   America
1002    Tim   41      USA    3.9   America
1003  Jenny   12  Germany    9.0    Europe

In [2]:
var_criada_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 1001 to 1003
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       4 non-null      object
 1   age        4 non-null      int64
 2   country    4 non-null      object
 3   score      4 non-null      float64
 4   continent  4 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 192.0+ bytes

In [3]:
var_criada_dataframe.dtypes #Obtem informações basicas

name          object
age            int64
country       object
score        float64
continent     object
dtype: object

In [4]:
var_criada_dataframe.index #Chama os index (equivale as linhas)

Index([1001, 1000, 1002, 1003], dtype='int64')

In [5]:
var_criada_dataframe.index.name = "User ID" #Dar um nome ao indice
print(var_criada_dataframe)

          name  age  country  score continent
User ID
1001      Mark   55    Italy    4.5    Europe
1000      John   33      USA    6.7   America
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe

In [6]:
var_criada_dataframe.reset_index() #Transforma o indice em coluna

   User ID   name  age  country  score continent
0     1001   Mark   55    Italy    4.5    Europe
1     1000   John   33      USA    6.7   America
2     1002    Tim   41      USA    3.9   America
3     1003  Jenny   12  Germany    9.0    Europe

In [7]:
var_criada_dataframe.reset_index().set_index("name") #Transforma o "nome" da coluna em indice

       User ID  age  country  score continent
name
Mark      1001   55    Italy    4.5    Europe
John      1000   33      USA    6.7   America
Tim       1002   41      USA    3.9   America
Jenny     1003   12  Germany    9.0    Europe

In [8]:
var_criada_dataframe = var_criada_dataframe.reset_index()
print(var_criada_dataframe)

   User ID   name  age  country  score continent
0     1001   Mark   55    Italy    4.5    Europe
1     1000   John   33      USA    6.7   America
2     1002    Tim   41      USA    3.9   America
3     1003  Jenny   12  Germany    9.0    Europe

In [9]:
var_criada_dataframe.reindex([999, 1000, 1001, 1004]) #Alterar um indice
print(var_criada_dataframe)

   User ID   name  age  country  score continent
0     1001   Mark   55    Italy    4.5    Europe
1     1000   John   33      USA    6.7   America
2     1002    Tim   41      USA    3.9   America
3     1003  Jenny   12  Germany    9.0    Europe

In [10]:
var_criada_dataframe.sort_index() #Classificar um indice

   User ID   name  age  country  score continent
0     1001   Mark   55    Italy    4.5    Europe
1     1000   John   33      USA    6.7   America
2     1002    Tim   41      USA    3.9   America
3     1003  Jenny   12  Germany    9.0    Europe

In [11]:
var_criada_dataframe.sort_values(["continent", "age"])

   User ID   name  age  country  score continent
1     1000   John   33      USA    6.7   America
2     1002    Tim   41      USA    3.9   America
3     1003  Jenny   12  Germany    9.0    Europe
0     1001   Mark   55    Italy    4.5    Europe

In [12]:
var_criada_dataframe.columns #Obtem informações sobre as colunas

Index(['User ID', 'name', 'age', 'country', 'score', 'continent'], dtype='object')

In [16]:
var_criada_dataframe.columns.name = "properties" #Atribui um nome aos cabeçalhos das colunas
print(var_criada_dataframe)

properties  User ID   name  age  country  score continent
0              1001   Mark   55    Italy    4.5    Europe
1              1000   John   33      USA    6.7   America
2              1002    Tim   41      USA    3.9   America
3              1003  Jenny   12  Germany    9.0    Europe

In [14]:
var_criada_dataframe.rename(columns={"name": "First Name", "age": "Age"}) #Renomeia os nomes das Colunas

properties  User ID First Name  Age  country  score continent
0              1001       Mark   55    Italy    4.5    Europe
1              1000       John   33      USA    6.7   America
2              1002        Tim   41      USA    3.9   America
3              1003      Jenny   12  Germany    9.0    Europe

In [19]:
var_criada_dataframe.drop(columns=["name", "country"], index=[1000, 1003])

      age  score continent
1001   55    4.5    Europe
1002   41    3.9   America

In [20]:
var_criada_dataframe.T #Atalho para df.transpose()->Altera suas colunas em linhas e vice-versa transpondo o DF

             1001     1000     1002     1003
name         Mark     John      Tim    Jenny
age            55       33       41       12
country     Italy      USA      USA  Germany
score         4.5      6.7      3.9      9.0
continent  Europe  America  America   Europe

In [21]:
var_criada_dataframe.loc[:, ["continent", "country", "name", "age", "score"]] #Reordena as colunas

     continent  country   name  age  score
1001    Europe    Italy   Mark   55    4.5
1000   America      USA   John   33    6.7
1002   America      USA    Tim   41    3.9
1003    Europe  Germany  Jenny   12    9.0

In [22]:
#Obs.: df.loc[selecao_linha, selecao_coluna]->Ele consulta seus rotulos usando a localização, para especificar linha/colunas deseja recuperar
var_criada_dataframe.loc[1000,"country"] #Valor único

'USA'

In [23]:
var_criada_dataframe.loc[:, "country"] # Uma coluna (1d)

1001      Italy
1000        USA
1002        USA
1003    Germany
Name: country, dtype: object

In [24]:
var_criada_dataframe.loc[:, ["country"]] # Uma coluna (2d)

      country
1001    Italy
1000      USA
1002      USA
1003  Germany

In [25]:
var_criada_dataframe.loc[:, ["country", "age"]] # Varias colunas

      country  age
1001    Italy   55
1000      USA   33
1002      USA   41
1003  Germany   12

In [26]:
var_criada_dataframe.loc[:, "name":"country"] # Intervalos colunas

       name  age  country
1001   Mark   55    Italy
1000   John   33      USA
1002    Tim   41      USA
1003  Jenny   12  Germany

In [27]:
var_criada_dataframe.loc[1000, :] # Uma linha (1d)

name            John
age               33
country          USA
score            6.7
continent    America
Name: 1000, dtype: object

In [28]:
var_criada_dataframe.loc[[1000], :] # Uma linha (2d)

      name  age country  score continent
1000  John   33     USA    6.7   America

In [29]:
var_criada_dataframe.loc[[1003, 1000], :] # Varias linhas

       name  age  country  score continent
1003  Jenny   12  Germany    9.0    Europe
1000   John   33      USA    6.7   America

In [30]:
var_criada_dataframe.loc[1000:1002, :] # Intervalos de linhas

      name  age country  score continent
1000  John   33     USA    6.7   America
1002   Tim   41     USA    3.9   America

In [31]:
#Obs.: df.iloc[selecao_linha, selecao_coluna]->Ele seleciona um subconjunto de um DF por posição,ou seja, é localização por indice
var_criada_dataframe.iloc[1, 2] #Valor único

'USA'

In [32]:
var_criada_dataframe.iloc[:, 2] # Uma coluna (1d)

1001      Italy
1000        USA
1002        USA
1003    Germany
Name: country, dtype: object

In [33]:
var_criada_dataframe.iloc[:, [2]] # Uma coluna (2d)

      country
1001    Italy
1000      USA
1002      USA
1003  Germany

In [34]:
var_criada_dataframe.iloc[:, [2, 1]] # Varias colunas

      country  age
1001    Italy   55
1000      USA   33
1002      USA   41
1003  Germany   12

In [35]:
var_criada_dataframe.iloc[:, :3] # Intervalos colunas

       name  age  country
1001   Mark   55    Italy
1000   John   33      USA
1002    Tim   41      USA
1003  Jenny   12  Germany

In [36]:
var_criada_dataframe.iloc[1, :] # Uma linha (1d)

name            John
age               33
country          USA
score            6.7
continent    America
Name: 1000, dtype: object

In [37]:
var_criada_dataframe.iloc[[1], :] # Uma linha (2d)

      name  age country  score continent
1000  John   33     USA    6.7   America

In [38]:
var_criada_dataframe.iloc[[3, 1], :] # Varias linhas

       name  age  country  score continent
1003  Jenny   12  Germany    9.0    Europe
1000   John   33      USA    6.7   America

In [39]:
var_criada_dataframe.iloc[1:3, :] # Intervalos de linhas

      name  age country  score continent
1000  John   33     USA    6.7   America
1002   Tim   41     USA    3.9   America

In [40]:
tf = (var_criada_dataframe["age"]> 40) & (var_criada_dataframe["country"] == "USA") # & (and); | (or); ~ (not)
print(tf)

1001    False
1000    False
1002     True
1003    False
dtype: bool

In [41]:
var_criada_dataframe.loc[tf, :]

     name  age country  score continent
1002  Tim   41     USA    3.9   America

In [46]:
var_criada_dataframe.loc[var_criada_dataframe.index > 1001, :]

       name  age  country  score continent
1002    Tim   41      USA    3.9   America
1003  Jenny   12  Germany    9.0    Europe